var m = document.getElementById("M");//获取播放器id
var text=document.getElementById("txt");
m.autoplay = true;//控制播放器在浏览器准备就绪的时候立即开始播放
var lyr=new Array(20);
var time=new Array(20);
alert("把屏幕横过来！");
setInterval(function(){
    var size= Math.round(m.currentTime);
//wz(size);


/*
[00:21.701]
[00:27.203]
[00:32.948]
[00:38.697]
[00:44.201]
[00:49.713]
[00:55.478]
[01:01.257]
[01:29.729]
[01:35.220]
[01:40.980]
[01:46.476]
[01:52.075]
[01:58.062]
[02:03.067]
[02:09.069]
[02:38.037]
[02:43.036]
[02:48.622]
[02:54.371]
*/
lyr[0]="你是信的开头诗的内容　童话的结尾";
lyr[1]="你是理所当然的奇迹　你是月色真美";
lyr[2]="你是圣诞老人送给我　好孩子的礼物";
lyr[3]="你是三千美丽世界里　我的一瓢水";
lyr[4]="所以让我再靠近一点点　因为你太温暖";
lyr[5]="我会再变得坚强一点点　因为你太柔软";
lyr[6]="交换无名指金色的契约　给彼此岁月";
lyr[7]="说好从今以后都牵着手　因为要走很远";
lyr[8]="你是我万水千山的冒险　要找的标记点";
lyr[10]="你是分割我人生的线　又将它们相连";
lyr[11]="你是前世千次的回眸　虔诚牵的手";
lyr[12]="你是其余所有的一切　是我的世界";
lyr[13]="所以请你再闪亮一点点　尽管我太平凡";
lyr[14]="我会再变得柔软一点点　因为你太敏感";
lyr[15]="交换无名指金色的契约　给彼此岁月";
lyr[16]="说好从今以后都牵着手　不管要走多远";
lyr[17]="让我再靠近一点点　因为你太温暖";
lyr[18]="我会再变得坚强一点点　因为你太柔软";
lyr[19]="交换无名指金色的契约　给彼此岁月";
lyr[20]="说好从今以后都牵着手　因为要走很远";


},1000/60);


function wz(t){
    text.innerHTML=(t);
    text.style.color='red';
}

